{
    "Greetings": {
        "Hello": "Hello! How can I help you today?",
        "Hi": "Hi! How can I help you today?",
        "Hey": "Hey! How can I help you today?",
        "Good morning": "Good morning! How can I help you today?",
        "Good afternoon": "Good afternoon! How can I help you today?",
        "Good evening": "Good evening! How can I help you today?",
        "Goodbye": "Goodbye! Have a great day!",
        "Bye": "Bye! Have a great day!",
        "See you later": "See you later! Have a great day!"
    },
    "Thanks": {
        "Thanks": "You're welcome! Let me know if you need help with anything else.",
        "Thank you": "You're welcome! Let me know if you need help with anything else.",
        "Thanks for your help": "You're welcome! Let me know if you need help with anything else.",
        "Thank you for your help": "You're welcome! Let me know if you need help with anything else."
    },
    "General Inquiries": {
        "How are you?": "I'm a bot, so I'm always here to help you!",
        "What can you do?": "I can help you with questions about our products and services, provide information about our business, and assist with common customer service inquiries.",
        "Can you help me?": "Of course! What do you need help with?",
        "I need help": "I'm here to help! What do you need assistance with?",
        "I have a question": "I'm here to answer your questions! What would you like to know?",
        "I'm looking for information": "I can provide information on our products and services. What are you looking for?",
        "I'm not sure": "No problem! Take your time and let me know if you have any questions.",
        "I'm just browsing": "Feel free to ask me any questions if you need help with anything!",
        "I'm interested in your products": "Great! What products are you interested in? I can provide more information.",
        "I'm interested in your services": "Great! What services are you interested in? I can provide more information.",
        "I'm looking for a specific product": "What product are you looking for? I can help you find it.",
        "I'm looking for a specific service": "What service are you looking for? I can help you find it.",
        "I need help with a purchase": "I can assist you with your purchase! What do you need help with?",
        "What is your name?": "My name is Business Bot.",
        "What is your purpose?": "I am here to help you with any questions you have about our products and services."
    },
    "Business Information": {
        "What are your business hours?": "Our business hours are Monday to Friday, 9 AM to 5 PM.",
        "Where are you located?": "We are located at 123 Business St., Business City, BC 12345.",
        "How can I contact customer service?": "You can contact customer service by emailing support@business.com or calling (123) 456-7890.",
        "What is your return policy?": "Our return policy allows returns within 30 days of purchase with a receipt.",
        "Do you offer international shipping?": "Yes, we offer international shipping to most countries. Additional charges may apply.",
        "Do you have a physical store?": "Yes, we have a physical store located at 123 Business St., Business City, BC 12345."
    },
    "Product Information": {
        "What products do you offer?": "We offer a wide range of products, including electronics, clothing, accessories, and more.",
        "Can you tell me about your electronics?": "Our electronics include smartphones, laptops, tablets, and other gadgets from top brands.",
        "Can you tell me about your clothing?": "Our clothing collection includes a variety of styles, sizes, and colors.",
        "Can you tell me about your accessories?": "Our accessories range from jewelry, watches, bags, and more to complement your style.",
        "Do you have any sales or promotions?": "Yes, we have ongoing sales and promotions. Check our website for the latest deals.",
        "What is the price of [product]?": "The price of [product] is [price].",
        "Do you offer discounts for bulk orders?": "Yes, we offer discounts for bulk orders. Contact our sales team for more information.",
        "Do you offer gift wrapping?": "Yes, we offer gift wrapping services for an additional fee."
    },
    "Service Information": {
        "What services do you offer?": "We offer a variety of services, including consulting, maintenance, repairs, and more.",
        "Can you tell me about your consulting services?": "Our consulting services cover a wide range of industries and expertise to help businesses succeed.",
        "Can you tell me about your maintenance services?": "Our maintenance services ensure your equipment and systems are running smoothly and efficiently.",
        "Can you tell me about your repair services?": "Our repair services fix and restore your products to optimal condition.",
        "Do you offer training programs?": "Yes, we offer training programs to help you and your team develop new skills and knowledge.",
        "Do you provide on-site support?": "Yes, we provide on-site support for installations, troubleshooting, and maintenance."
    },
    "New Questions": {
        "Why should I buy from you?": "Here are some reasons why you might consider buying from us:\n\n1. Quality Products: We offer high-quality products that are designed to meet your needs and exceed your expectations.\n\n2. Customer Service: Our team is dedicated to providing excellent customer service and support before, during, and after your purchase.\n\n3. Competitive Pricing: We strive to offer competitive pricing to provide you with value for your money.\n\n4. Fast Shipping: We aim to process and ship orders quickly to ensure you receive your products in a timely manner.\n\n5. Trustworthiness: We are a reputable company with a strong track record of customer satisfaction and reliability.\n\nUltimately, the decision to buy from us is yours, and we are here to assist you in any way we can."
    }
}